In [5]:
def missing_value(list_missing_value):
    list_missing_value= sorted(list_missing_value)

    for i in range(1,len(list_missing_value)): 
        if list_missing_value[i] - list_missing_value[i-1] != 1:
            print('The missing value is:', (list_missing_value[i])-1)
    return None

In [7]:
num_list=[1,4,3,2,5,8,7]
num_list.sort()

missing_value(num_list)

The missing value is: 6

In [49]:
def remove_dup(dup_list):
    removed_list=[]
    for i in range(0,len(dup_list)):
   # generating a random number in the range 1 to 20
        r=dup_list[i]
   # checking whether the generated random number is not in the
   # randomList
        if r not in removed_list:
           removed_list.append(r)


    print(removed_list)
       
    return None

In [51]:
#write a function to remove duplicates from a list of numbers

list_duplicate = [100, 20, -30, 100, 20, 0, -30]

remove_dup(list_duplicate)

[100, 20, -30, 0]

In [54]:
#write a function to remove duplicates from a list of numbers

list_duplicate = [100, 20, -30, 100, 20, 0, -30]

set_list_duplicate=set(list_duplicate)
set_list_duplicate

{-30, 0, 20, 100}

* **Pandas** : Python Data Analysis
* **Numpy**  : Numerical Python
* **Scipy**  : Scientific Python
* **Matplotlib** : Plotting Library

In [4]:
import pandas as pd 
'''creating sample of dataset by using dictionary'''
''' creating a data frame from the deictionary'''
''' keys are the column and values are the data'''

mydata={
            'Name':['Mohammed','Nurual','Aziz','Fatimah'],
                    'Age':[23,32,30,27],
                    'City':['Kuala Lumpur','Kunatan','Shah Alam','Selangor'],
                    'Salary':[5000,7000,12000,9000]}

In [6]:
type(mydata)

dict

In [10]:
#convert dictionary to data frame

df = pd.DataFrame(mydata)

df.head()

       Name  Age          City  Salary
0  Mohammed   23  Kuala Lumpur    5000
1    Nurual   32       Kunatan    7000
2      Aziz   30     Shah Alam   12000
3   Fatimah   27      Selangor    9000

In [14]:
data1 = {
            'A':['A1','A2','A3','A4'],
            'B':['B1','B2','B3','B4'],
            'C':['C1','C2','C3','C4'],
            'D':['D1','D2','D3','D4']
}
data2 = {
            'A':['A5','A6','A7','A8'],
            'B':['B5','B6','B7','B8'],
            'C':['C5','C6','C7','C8'],
            'D':['D5','D6','D7','D8']
}

In [18]:
#convert dictionary to data frame

df_data1= pd.DataFrame(data1)

df_data1.head()

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [20]:
#convert dictionary to data frame

df_data2= pd.DataFrame(data2)

df_data2.head()

    A   B   C   D
0  A5  B5  C5  D5
1  A6  B6  C6  D6
2  A7  B7  C7  D7
3  A8  B8  C8  D8

In [28]:
df_data1_data2= [df_data1, df_data2]
df_1_2= pd.concat(df_data1_data2)
df_1_2.head(8)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4
0  A5  B5  C5  D5
1  A6  B6  C6  D6
2  A7  B7  C7  D7
3  A8  B8  C8  D8

In [32]:
df_1_2 = df_1_2.reset_index(drop=True)

df_1_2.head(8)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4
4  A5  B5  C5  D5
5  A6  B6  C6  D6
6  A7  B7  C7  D7
7  A8  B8  C8  D8

In [35]:
data3 = {
            'E':['E1','E2','E3','E4','E5','E6','E7','E8'],
            'F':['F1','F2','F3','F4','F5','F6','F7','F8']
}

In [37]:

df_data3= pd.DataFrame(data3)
df_data3.head(8)

    E   F
0  E1  F1
1  E2  F2
2  E3  F3
3  E4  F4
4  E5  F5
5  E6  F6
6  E7  F7
7  E8  F8

In [39]:
df_all= [df_1_2, df_data3]
df_all= pd.concat(df_all, axis=1)
df_all.head(8)

    A   B   C   D   E   F
0  A1  B1  C1  D1  E1  F1
1  A2  B2  C2  D2  E2  F2
2  A3  B3  C3  D3  E3  F3
3  A4  B4  C4  D4  E4  F4
4  A5  B5  C5  D5  E5  F5
5  A6  B6  C6  D6  E6  F6
6  A7  B7  C7  D7  E7  F7
7  A8  B8  C8  D8  E8  F8

In [41]:
df_all.shape

(8, 6)

In [ ]:
#Create your own dataset, concatenate in terms of rows once, and in terms of colomns once again.

In [43]:
data_stud1 = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [20, 21, 19, 22, 20],
    "Grade": ["A", "B", "A", "C", "B"],
    "Class": ["Math", "Science", "English", "History", "Math"]
}
data_stud2 = {
    "Name": ["Frank", "Grace", "Hannah", "Ivy", "Jack"],
    "Age": [23, 22, 21, 20, 19],
    "Grade": ["B", "A", "C", "B", "A"],
    "Class": ["History", "Math", "Science", "English", "Math"]
}

In [63]:
df_datastud1=pd.DataFrame(data_stud1)
df_datastud2=pd.DataFrame(data_stud2)

df_datastud1.head()

      Name  Age Grade    Class
0    Alice   20     A     Math
1      Bob   21     B  Science
2  Charlie   19     A  English
3    David   22     C  History
4      Eva   20     B     Math

In [59]:
df_datastud2.head()

     Name  Age Grade    Class
0   Frank   23     B  History
1   Grace   22     A     Math
2  Hannah   21     C  Science
3     Ivy   20     B  English
4    Jack   19     A     Math

In [91]:
df_datastud1_datastud2= [df_datastud1,df_datastud2]
df_st1_st2=pd.concat(df_datastud1_datastud2)
df_st1_st2=df_st1_st2.reset_index(drop=True)
df_st1_st2.head(10)

      Name  Age Grade    Class
0    Alice   20     A     Math
1      Bob   21     B  Science
2  Charlie   19     A  English
3    David   22     C  History
4      Eva   20     B     Math
5    Frank   23     B  History
6    Grace   22     A     Math
7   Hannah   21     C  Science
8      Ivy   20     B  English
9     Jack   19     A     Math

In [95]:
new_2column = {
    "Gender": ["Female", "Male", "Male", "Male", "Female","Male", "Female", "Female", "Female", "Male"],
    "Favorite Animal": ["Dog", "Cat", "Rabbit", "Parrot", "Snake","Bird", "Fish", "Turtle", "Horse", "Dolphin"]
}

In [99]:
df_new_2=pd.DataFrame(new_2column)
df_new_2.head(10)

   Gender Favorite Animal
0  Female             Dog
1    Male             Cat
2    Male          Rabbit
3    Male          Parrot
4  Female           Snake
5    Male            Bird
6  Female            Fish
7  Female          Turtle
8  Female           Horse
9    Male         Dolphin

In [101]:
df_all_stud=[df_st1_st2,df_new_2]
df_all_stud=pd.concat(df_all_stud,axis=1)
df_all_stud.head(10)

      Name  Age Grade    Class  Gender Favorite Animal
0    Alice   20     A     Math  Female             Dog
1      Bob   21     B  Science    Male             Cat
2  Charlie   19     A  English    Male          Rabbit
3    David   22     C  History    Male          Parrot
4      Eva   20     B     Math  Female           Snake
5    Frank   23     B  History    Male            Bird
6    Grace   22     A     Math  Female            Fish
7   Hannah   21     C  Science  Female          Turtle
8      Ivy   20     B  English  Female           Horse
9     Jack   19     A     Math    Male         Dolphin